/*
ما هو الفرق بين 
frame work
laibrarity
الفريم اعم و اشمل من المكتبة 
يعني المكتبة جزء من الفريم

مثال لو بدي ادرس 
larvel ---> في الباك اند ---> frame work
react ---> في الفرونت اند ---> laibrarity


bootstrap 
ليش بنتعلمه
1بيوفر component f\بتساعدني في اللغة بلدا ما اعيد كتابتها لحالي
2 بيوفر كلاسات جاهزة باحجام و الوان مختلفة
3 gride systemبزبط الحجم بدل ما استخدم ميديا كويري 




مقاسات الشاشات
small (sm)(567px) التلفونات
medium (md)(768px) التلفون امقلوب التابلت الايباد
large (l)(992px)اللاب و الكمبيوتر
extra large (xl)(1200px) اللابات الكبيرة
extra extra large (xxl)(1400px)الشاشات الكبيرة
*/